Прекрасно сделано
Но есть несколько деталей

1. Возможное число уроков - 8

2. Дни недели лучше сильнее отделять друг от друга(хотя бы строкой).А ещё лучше жирнее выделить.

3. При выдаче меню предмет/учитель/кабинет есть требование выдавать сначала учителя, а потом список предметов, которые он преподает.

4.Напротив кабинета просят выставлять пометку типа "занят"/"не занят".

5.По идее, должно быть в меню что-то типа "параметры", где будет лежать все остальное...

В остальном все вроде в полном порядке.